#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
aws_vpc.this: Refreshing state... [id=vpc-0e7b209baa9aca9ae]
aws_route.internet_route: Refreshing state... [id=r-rtb-0018d68f80c64bbe21080289494]
aws_iam_role_policy_attachment.custom: Refreshing state... [id=app-10-ec2-role-20240811021741521400000001]
aws_iam_instance_profile.ec2_profile: Refreshing state... [id=app-10-ec2-profile]
aws_security_group_rule.egress_instance_sg: Refreshing state... [id=sgrule-1308979298]
aws_internet_gateway.this_igw: Refreshing state... [id=igw-0436c6915cbf33c68]
aws_security_group.instance_sg: Refreshing state... [id=sg-0a01dfd3a66855300]
aws_iam_role.ec2_role: Refreshing state... [id=app-10-ec2-role]
aws_instance.app-server: Refreshing state... [id=i-01ffe5315b9da7838]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-2]
aws_kms_key.encrypt_ssm: Refreshing state... [id=5374c794-cbc2-4dc6-882f-f90ff4df4566]
aws_kms_alias.encryption_secret: Refreshing state... [id=alias/app-10]
data.aws_iam_policy_document.encrypt_ssm_policy: Reading...
data.aws_iam_policy_document.encrypt_ssm_policy: Read complete after 0s [id=2103847028]
aws_kms_key_policy.encrypt_ssm_policy: Refreshing state... [id=5374c794-cbc2-4dc6-882f-f90ff4df4566]
aws_default_security_group.default: Refreshing state... [id=sg-082b651a444fe8c5f]
aws_route_table.this_rt_private: Refreshing state... [id=rtb-0131933f15683e15e]
aws_subnet.public[0]: Refreshing state... [id=subnet-0cb64c599f53573ad]
aws_subnet.public[1]: Refreshing state... [id=subnet-0da4b6129a0ba3309]
aws_subnet.private[1]: Refreshing state... [id=subnet-0ac8ca0072da1c0db]
aws_subnet.private[0]: Refreshing state... [id=subnet-0b7dfe19dad318ec9]
aws_route_table.this_rt: Refreshing state... [id=rtb-0018d68f80c64bbe2]
aws_security_group.custom_sg: Refreshing state... [id=sg-00ec4a6b18a61146f]
aws_security_group_rule.egress_custom_sg: Refreshing state... [id=sgrule-3703941867]
aws_security_group_rule.ingress_custom_sg: Refreshing state... [id=sgrule-1132316349]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-083ae2a95327e3225]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04e2f4b0be6318aaf]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d831772dd4448ae5]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0d166163659ad512d]
aws_elasticache_subnet_group.elasticache_subnet: Refreshing state... [id=app-10]
aws_elasticache_cluster.cache_cluster: Refreshing state... [id=app-10]
aws_ssm_parameter.elasticache_ep: Refreshing state... [id=/app-10/endpoint]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_instance_profile.ec2_profile will be destroyed
  # (because aws_iam_instance_profile.ec2_profile is not in configuration)
  - resource "aws_iam_instance_profile" "ec2_profile" {
      - arn         = "arn:aws:iam::743794601996:instance-profile/app-10-ec2-profile" -> null
      - create_date = "2024-08-11T02:17:41Z" -> null
      - id          = "app-10-ec2-profile" -> null
      - name        = "app-10-ec2-profile" -> null
      - path        = "/" -> null
      - role        = "app-10-ec2-role" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "Source" = "https://github.com/kunduso/amazon-elasticache-memcached-tf"
        } -> null
      - unique_id   = "AIPA22LM46AGG7MFRAUD2" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_policy.ssm_parameter_policy will be created
  + resource "aws_iam_policy" "ssm_parameter_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to read the ElastiCache endpoint stored in the SSM Parameter Store."
      + id               = (known after apply)
      + name             = "app-10-ssm-parameter-read-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-2:743794601996:parameter/app-10/endpoint",
                        ]
                    },
                  + {
                      + Action   = [
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:kms:us-east-2:743794601996:key/5374c794-cbc2-4dc6-882f-f90ff4df4566",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Source" = "https://github.com/kunduso/amazon-elasticache-memcached-tf"
        }
    }

  # aws_iam_role.ec2_role will be destroyed
  # (because aws_iam_role.ec2_role is not in configuration)
  - resource "aws_iam_role" "ec2_role" {
      - arn                   = "arn:aws:iam::743794601996:role/app-10-ec2-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-08-11T02:17:40Z" -> null
      - force_detach_policies = false -> null
      - id                    = "app-10-ec2-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "app-10-ec2-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Source" = "https://github.com/kunduso/amazon-elasticache-memcached-tf"
        } -> null
      - unique_id             = "AROA22LM46AGEOFKJRXEY" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.custom will be destroyed
  # (because aws_iam_role_policy_attachment.custom is not in configuration)
  - resource "aws_iam_role_policy_attachment" "custom" {
      - id         = "app-10-ec2-role-20240811021741521400000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore" -> null
      - role       = "app-10-ec2-role" -> null
    }

  # aws_internet_gateway.this_igw will be destroyed
  # (because aws_internet_gateway.this_igw is not in configuration)
  - resource "aws_internet_gateway" "this_igw" {
      - arn      = "arn:aws:ec2:us-east-2:743794601996:internet-gateway/igw-0436c6915cbf33c68" -> null
      - id       = "igw-0436c6915cbf33c68" -> null
      - owner_id = "743794601996" -> null
      - tags     = {
          - "Name" = "app-10-gateway"
        } -> null
      - tags_all = {
          - "Name"   = "app-10-gateway"
          - "Source" = "https://github.com/kunduso/amazon-elasticache-memcached-tf"
        } -> null
      - vpc_id   = "vpc-0e7b209baa9aca9ae" -> null
    }

  # aws_route.internet_route will be destroyed
  # (because aws_route.internet_route is not in configuration)
  - resource "aws_route" "internet_route" {
      - destination_cidr_block      = "0.0.0.0/0" -> null
      - gateway_id                  = "igw-0436c6915cbf33c68" -> null
      - id                          = "r-rtb-0018d68f80c64bbe21080289494" -> null
      - origin                      = "CreateRoute" -> null
      - route_table_id              = "rtb-0018d68f80c64bbe2" -> null
      - state                       = "active" -> null
        # (13 unchanged attributes hidden)
    }

  # aws_security_group.instance_sg will be destroyed
  # (because aws_security_group.instance_sg is not in configuration)
  - resource "aws_security_group" "instance_sg" {
      - arn                    = "arn:aws:ec2:us-east-2:743794601996:security-group/sg-0a01dfd3a66855300" -> null
      - description            = "manage traffic for app-10 EC2" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "allow traffic to reach outside the vpc"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0a01dfd3a66855300" -> null
      - ingress                = [] -> null
      - name                   = "app-10_ec2_allow_inbound_access" -> null
      - owner_id               = "743794601996" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "app-10-sg-ec2"
        } -> null
      - tags_all               = {
          - "Name"   = "app-10-sg-ec2"
          - "Source" = "https://github.com/kunduso/amazon-elasticache-memcached-tf"
        } -> null
      - vpc_id                 = "vpc-0e7b209baa9aca9ae" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_security_group_rule.egress_instance_sg will be destroyed
  # (because aws_security_group_rule.egress_instance_sg is not in configuration)
  - resource "aws_security_group_rule" "egress_instance_sg" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "allow traffic to reach outside the vpc" -> null
      - from_port              = 0 -> null
      - id                     = "sgrule-1308979298" -> null
      - protocol               = "-1" -> null
      - security_group_id      = "sg-0a01dfd3a66855300" -> null
      - security_group_rule_id = "sgr-09ead0df85e624281" -> null
      - self                   = false -> null
      - to_port                = 0 -> null
      - type                   = "egress" -> null
    }

Plan: 1 to add, 0 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*